inventoryservice/artillerytests/userBooking.yml
config:
  target: "http://127.0.0.1:7331"
  timeout: 120
  phases:
    # - duration: 20
    #   arrivalRate: 1
    # - duration: 20
    #   arrivalRate: 20
      - duration: 2
        arrivalRate: 10
  processor: "./my-functions.js"

scenarios:
  - name: "Add a booking"
    flow:
      # call generateRandomDataListings() to create the name, email, and password variables
      - function: "generateRandomDataListings"
      - post:
          url: "/inventory/bookings"
          json:
            booking_uuid: "{{ booking_uuid }}"
            booking_created_at: "{{ booking_created_at }}"
            booking_start: "{{ booking_start }}"
            # booking_day_one: "{{ booking_day_one }}"
            # booking_day_two: "{{ booking_day_two }}"
            booking_end: "{{ booking_end }}"
            booking_length: "{{ booking_length }}"
            booking_cost_per_night: "{{ booking_cost_per_night }}"
            booking_total_cost: "{{ booking_total_cost }}"
            listing_uuid: "{{ listing_uuid }}"
            photo_accuracy_rating: "{{ photo_accuracy_rating }}"
            user_id: "{{ user_id }}"
            
      # Print the data we're sending while debugging the script:
      # - log: "Sent a request to /inventory/bookings with {{ booking_uuid }} {{ booking_created_at }} {{ booking_start }} {{ booking_end }} {{ booking_length }} {{ booking_cost_per_night }} {{ booking_total_cost }} {{ listing_uuid }} {{ photo_accuracy_rating }} {{ user_id }}"


# booking_uuid: 91020, booking_created_at: '2018-02-17 07:01:01', booking_start:'2018-01-04', booking_end: '2018-01-06', booking_length: 2, booking_cost_per_night: 74, booking_total_cost: 148, listing_uuid: 100004, photo_accuracy_rating: 'NULL', user_id: 777