inventoryservice/artillerytests/userIdTests.yml
config:
  target: "http://127.0.0.1:7331"
  phases:
    - duration: 20
      arrivalRate: 1
    # - duration: 600
    #   arrivalRate: 50
  processor: "./my-functions.js"

scenarios:
  - name: "Add a user"
    flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomData"
      - post:
          url: "/inventory/addUser"
          json:
            userID: "{{ userID }}"
            # email: "{{ email }}"
            # password: "{{ password }}"
      # Print the data we're sending while debugging the script:
      - log: "Sent a request to /inventory/addUser with {{ userID }}"